SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;


CREATE TABLE TABLE_ANSWER (
  `id` int(11) NOT NULL,
  `text` tinytext CHARACTER SET utf8 COLLATE utf8_bin NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

INSERT INTO TABLE_ANSWER (`id`, `text`) VALUES
(1, '机不可失，时不再来'),
(2, '这会很美好'),
(3, '不要乱来'),
(4, '相信你独到的思维'),
(5, '寻找更多的选择'),
(6, '你将不得不妥协'),
(7, '准备迎接意外'),
(8, '当然'),
(9, '相信你的感觉'),
(10, '时间会解决一切'),
(11, '短见'),
(12, '它不可能影响你的生活'),
(13, '不是'),
(14, '是的'),
(15, '再想一想，不可以的理由'),
(16, '一念之间'),
(17, '有时候1+1不等于2'),
(18, '一旦有了意志，脚步也会轻松起来'),
(19, '有时候，跟别人说说也大有裨益'),
(20, '朝着既定目标走，就不会迷失'),
(21, '要耐心'),
(22, '你会得到想要的结果'),
(23, '这具有重大意义'),
(24, '不要指望它'),
(25, '询问你的母亲'),
(26, '这已经超出了你的能力范围'),
(27, '已经超出了你的能力范围'),
(28, '现在不要提问了，神有点累了'),
(29, '你必须现在行动'),
(30, '现在是制定计划的好时机'),
(31, '这是毫无疑问的'),
(32, '这将引起轰动'),
(33, '仔细倾听，然后你就会知道'),
(34, '采取一种冒险的态度'),
(35, '请别失望'),
(36, '一步之遥'),
(37, '平淡的心去追求'),
(38, '只要心中有希望存在，就有幸福存在'),
(39, '你应该找好机会，准备好了，然后……'),
(40, '再想一想吧，还有别的方法吗？'),
(41, '无论你做什么结果将是持久的'),
(42, '相信你的第一直觉'),
(43, '如果你不抗拒'),
(44, '按照你被告知的去做'),
(45, '谁都不敢保证'),
(46, '不可预测'),
(47, '答案在镜子里'),
(48, '只是一场梦'),
(49, '谁都不敢保证'),
(50, '只要你愿意的话'),
(51, '保存你的实力'),
(52, '它将使你付出'),
(53, '总要开心地做事情，对吧'),
(54, '未来的路还很漫长'),
(55, '这不是最好的选择'),
(56, '只有不断寻找机会的人才会及时把握机会'),
(57, '你的行为将改善事情'),
(58, '不要犹豫'),
(59, '相信你自己'),
(60, '接受习惯的改变');

CREATE TABLE TABLE_QUESTION (
  `id` int(11) NOT NULL,
  `type` tinyint(4) NOT NULL,
  `text` tinytext CHARACTER SET utf8 COLLATE utf8_bin NOT NULL,
  `click` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

INSERT INTO TABLE_QUESTION (`id`, `type`, `text`, `click`) VALUES
(1, 0, '华工的水管能在我毕业前修好吗？', 0),
(2, 0, '华工什么时候停止施工？', 0),
(3, 0, '期末考试的难度会提高一点吗？现在太简单了！', 0),
(4, 0, '体育课的数量会增加吗？', 0),
(5, 0, '我能通过jw2005抢到课吗？', 0),
(6, 0, '求问一饭伙食是否会改善？', 0),
(7, 0, '考研从现在开始准备可以吗？', 0),
(8, 0, '何时能在大学校园内听见清晰的广播声？', 0),
(9, 0, '身边的人都考研，我该如何选择？', 0),
(10, 0, '上大学之后失去了学习的斗志，我还能变回以前的自己吗？', 0),
(11, 0, '能有一天不被蚊子咬吗？', 0),
(12, 0, '期末考试是真的烦，可以取消吗？', 0),
(13, 0, '大学生课外做兼职自给自足但却影响学习好不好？', 0),
(14, 0, '朋友或舍友之间有相互的不满是该摊开表面说，还是忍住或偷偷暗示？', 0),
(15, 0, '外卖什么时候才能不被偷？', 0),
(16, 0, '如果你的家乡没有适合你的工作岗位，要为了父母回去吗？', 0),
(17, 0, '我的大学怎么跟电视剧演的不一样？', 0),
(18, 0, '舍友有没有背着我偷偷学习？', 0),
(19, 0, '我要不要在大学期间谈恋爱？', 0),
(20, 0, '沉迷撸猫吸狗会有前途吗？', 0),
(21, 1, '我能保研吗？', 0),
(22, 1, '我能追求到心中的那个Ta吗？', 0),
(23, 1, '这个月的桃花运怎么样？', 0),
(24, 1, '异地恋应该坚持吗？', 0),
(25, 1, 'Ta对我是真心的吗？', 0),
(26, 1, '在大学里，我能交到和以前一样棒的好朋友吗？', 0),
(27, 1, '考试压力好大，我能坚持住吗？', 0),
(28, 1, '该不该坚持现在不喜欢的专业呢？', 0),
(29, 1, '我四六级可以过吗？', 0),
(30, 1, '我喜欢的Ta会跟我表白吗？', 0),
(31, 1, '毕业之后还能和大学的好伙伴维持这么好的友谊吗？', 0),
(32, 1, '当一条咸鱼很舒服却迷茫，我是否应该改变自己？', 0),
(33, 1, '总是控制不住剁手买喜欢的东西，应该克制吗？', 0),
(34, 1, '就业应该选择和大学专业相符的职业吗？', 0),
(35, 1, '对某件事犹豫不定，很怕自己后悔，我应该去完成吗？', 0),
(36, 1, '明天没有早课也要早起吗？', 0),
(37, 1, '我现在做的决定真的正确吗？', 0),
(38, 1, '我应该去更大更远的城市发展吗？', 0),
(39, 1, '我离心目中的我是否越来越远？', 0),
(40, 1, '如果可以从头再来，我会做出一样的选择吗?', 0),
(41, 1, '我能在大学四年脱单吗？', 0),
(42, 1, '我将来能成为亿万富翁、迎娶白富美、登上人生巅峰吗？', 0),
(43, 2, '想来一场说走就走的旅行，我应该去做吗？', 0),
(44, 2, '是世界改变了我，还是我改变了世界？', 0),
(45, 2, '全世界能否同心协力共同抵御环境问题？', 0),
(46, 2, '某一天我们是否可以做到畅游世界，再没有国界的限制？', 0),
(47, 2, '想尽自己的一份力量去改变这个世界，我该怎么做？', 0),
(48, 2, '大千世界，无奇不有，为何就没有我钟爱的人？', 0),
(49, 2, '我真的是我吗？', 0),
(50, 2, '我热爱世界，世界也同样热爱我吗？', 0),
(51, 2, '对待理性缺乏的世界，我该何去何从？', 0),
(52, 2, '社会是否真的需要我们的发声？', 0),
(53, 2, '究竟什么才是我人生的目的，我是否可以找到答案？', 0),
(54, 2, '平行世界的那个我会不会比我过得好？', 0),
(55, 2, '面对社会我们也要保持真正的自己吗？', 0),
(56, 2, '身边就有键盘侠，应该制止他的行为吗？', 0),
(57, 2, '会不会有一天能回到过去？', 0),
(58, 2, '婚姻的存在是应付还是自己的情感需要？', 0),
(59, 2, '我们是否被另一个世界的人统治着？', 0),
(60, 2, '小猪佩奇身上纹，掌声送给社会人，我够社会吗？', 0),
(61, 2, '这个世界是可知的还是不可知的？', 0);


ALTER TABLE TABLE_ANSWER
  ADD PRIMARY KEY (`id`);

ALTER TABLE TABLE_QUESTION
  ADD PRIMARY KEY (`id`);


ALTER TABLE TABLE_ANSWER
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=61;

ALTER TABLE TABLE_QUESTION
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=62;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
